espressif/esp-idf/components/soc/esp32s31/register/soc/lp_clkrst_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_AONCLKRST_ROOT_CLK_CONF_REG register
 *  need_des
 */
#define LP_AONCLKRST_ROOT_CLK_CONF_REG (DR_REG_LP_AONCLKRST_BASE + 0x0)
/** LP_AONCLKRST_SLOW_CLK_SEL : R/W; bitpos: [25:23]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_SLOW_CLK_SEL    0x00000007U
#define LP_AONCLKRST_SLOW_CLK_SEL_M  (LP_AONCLKRST_SLOW_CLK_SEL_V << LP_AONCLKRST_SLOW_CLK_SEL_S)
#define LP_AONCLKRST_SLOW_CLK_SEL_V  0x00000007U
#define LP_AONCLKRST_SLOW_CLK_SEL_S  23
/** LP_AONCLKRST_FAST_CLK_SEL : R/W; bitpos: [27:26]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_FAST_CLK_SEL    0x00000003U
#define LP_AONCLKRST_FAST_CLK_SEL_M  (LP_AONCLKRST_FAST_CLK_SEL_V << LP_AONCLKRST_FAST_CLK_SEL_S)
#define LP_AONCLKRST_FAST_CLK_SEL_V  0x00000003U
#define LP_AONCLKRST_FAST_CLK_SEL_S  26
/** LP_AONCLKRST_PLL80M_CLK_FORCE_ON : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_PLL80M_CLK_FORCE_ON    (BIT(28))
#define LP_AONCLKRST_PLL80M_CLK_FORCE_ON_M  (LP_AONCLKRST_PLL80M_CLK_FORCE_ON_V << LP_AONCLKRST_PLL80M_CLK_FORCE_ON_S)
#define LP_AONCLKRST_PLL80M_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_PLL80M_CLK_FORCE_ON_S  28
/** LP_AONCLKRST_XTAL_CLK_FORCE_ON : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON    (BIT(29))
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON_M  (LP_AONCLKRST_XTAL_CLK_FORCE_ON_V << LP_AONCLKRST_XTAL_CLK_FORCE_ON_S)
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_XTAL_CLK_FORCE_ON_S  29
/** LP_AONCLKRST_FOSC_CLK_FORCE_ON : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON    (BIT(30))
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON_M  (LP_AONCLKRST_FOSC_CLK_FORCE_ON_V << LP_AONCLKRST_FOSC_CLK_FORCE_ON_S)
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_FOSC_CLK_FORCE_ON_S  30
/** LP_AONCLKRST_ANA_SEL_REF_PLL8M : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M    (BIT(31))
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M_M  (LP_AONCLKRST_ANA_SEL_REF_PLL8M_V << LP_AONCLKRST_ANA_SEL_REF_PLL8M_S)
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M_V  0x00000001U
#define LP_AONCLKRST_ANA_SEL_REF_PLL8M_S  31

/** LP_AONCLKRST_LP_CLK_PO_EN_REG register
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_PO_EN_REG (DR_REG_LP_AONCLKRST_BASE + 0x4)
/** LP_AONCLKRST_CLK_CORE_EFUSE_OEN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN    (BIT(0))
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN_M  (LP_AONCLKRST_CLK_CORE_EFUSE_OEN_V << LP_AONCLKRST_CLK_CORE_EFUSE_OEN_S)
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_CORE_EFUSE_OEN_S  0
/** LP_AONCLKRST_CLK_LP_BUS_OEN : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_LP_BUS_OEN    (BIT(1))
#define LP_AONCLKRST_CLK_LP_BUS_OEN_M  (LP_AONCLKRST_CLK_LP_BUS_OEN_V << LP_AONCLKRST_CLK_LP_BUS_OEN_S)
#define LP_AONCLKRST_CLK_LP_BUS_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_LP_BUS_OEN_S  1
/** LP_AONCLKRST_CLK_AON_SLOW_OEN : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_AON_SLOW_OEN    (BIT(2))
#define LP_AONCLKRST_CLK_AON_SLOW_OEN_M  (LP_AONCLKRST_CLK_AON_SLOW_OEN_V << LP_AONCLKRST_CLK_AON_SLOW_OEN_S)
#define LP_AONCLKRST_CLK_AON_SLOW_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_AON_SLOW_OEN_S  2
/** LP_AONCLKRST_CLK_AON_FAST_OEN : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_AON_FAST_OEN    (BIT(3))
#define LP_AONCLKRST_CLK_AON_FAST_OEN_M  (LP_AONCLKRST_CLK_AON_FAST_OEN_V << LP_AONCLKRST_CLK_AON_FAST_OEN_S)
#define LP_AONCLKRST_CLK_AON_FAST_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_AON_FAST_OEN_S  3
/** LP_AONCLKRST_CLK_SLOW_OEN : R/W; bitpos: [4]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_SLOW_OEN    (BIT(4))
#define LP_AONCLKRST_CLK_SLOW_OEN_M  (LP_AONCLKRST_CLK_SLOW_OEN_V << LP_AONCLKRST_CLK_SLOW_OEN_S)
#define LP_AONCLKRST_CLK_SLOW_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_SLOW_OEN_S  4
/** LP_AONCLKRST_CLK_FAST_OEN : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_FAST_OEN    (BIT(5))
#define LP_AONCLKRST_CLK_FAST_OEN_M  (LP_AONCLKRST_CLK_FAST_OEN_V << LP_AONCLKRST_CLK_FAST_OEN_S)
#define LP_AONCLKRST_CLK_FAST_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_FAST_OEN_S  5
/** LP_AONCLKRST_CLK_FOSC_OEN : R/W; bitpos: [6]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_FOSC_OEN    (BIT(6))
#define LP_AONCLKRST_CLK_FOSC_OEN_M  (LP_AONCLKRST_CLK_FOSC_OEN_V << LP_AONCLKRST_CLK_FOSC_OEN_S)
#define LP_AONCLKRST_CLK_FOSC_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_FOSC_OEN_S  6
/** LP_AONCLKRST_CLK_RC32K_OEN : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_RC32K_OEN    (BIT(7))
#define LP_AONCLKRST_CLK_RC32K_OEN_M  (LP_AONCLKRST_CLK_RC32K_OEN_V << LP_AONCLKRST_CLK_RC32K_OEN_S)
#define LP_AONCLKRST_CLK_RC32K_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_RC32K_OEN_S  7
/** LP_AONCLKRST_CLK_SXTAL_OEN : R/W; bitpos: [8]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_SXTAL_OEN    (BIT(8))
#define LP_AONCLKRST_CLK_SXTAL_OEN_M  (LP_AONCLKRST_CLK_SXTAL_OEN_V << LP_AONCLKRST_CLK_SXTAL_OEN_S)
#define LP_AONCLKRST_CLK_SXTAL_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_SXTAL_OEN_S  8
/** LP_AONCLKRST_CLK_SOSC_OEN : R/W; bitpos: [9]; default: 0;
 *  1'b1: probe sosc clk on
 *  1'b0: probe sosc clk off
 */
#define LP_AONCLKRST_CLK_SOSC_OEN    (BIT(9))
#define LP_AONCLKRST_CLK_SOSC_OEN_M  (LP_AONCLKRST_CLK_SOSC_OEN_V << LP_AONCLKRST_CLK_SOSC_OEN_S)
#define LP_AONCLKRST_CLK_SOSC_OEN_V  0x00000001U
#define LP_AONCLKRST_CLK_SOSC_OEN_S  9

/** LP_AONCLKRST_MISC_REG register
 *  need_des
 */
#define LP_AONCLKRST_MISC_REG (DR_REG_LP_AONCLKRST_BASE + 0x8)
/** LP_AONCLKRST_ETM_EVENT_TICK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_ETM_EVENT_TICK_EN    (BIT(31))
#define LP_AONCLKRST_ETM_EVENT_TICK_EN_M  (LP_AONCLKRST_ETM_EVENT_TICK_EN_V << LP_AONCLKRST_ETM_EVENT_TICK_EN_S)
#define LP_AONCLKRST_ETM_EVENT_TICK_EN_V  0x00000001U
#define LP_AONCLKRST_ETM_EVENT_TICK_EN_S  31

/** LP_AONCLKRST_TIMER_REG register
 *  need_des
 */
#define LP_AONCLKRST_TIMER_REG (DR_REG_LP_AONCLKRST_BASE + 0xc)
/** LP_AONCLKRST_LP_TIMER_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_TIMER_RST_EN    (BIT(31))
#define LP_AONCLKRST_LP_TIMER_RST_EN_M  (LP_AONCLKRST_LP_TIMER_RST_EN_V << LP_AONCLKRST_LP_TIMER_RST_EN_S)
#define LP_AONCLKRST_LP_TIMER_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_TIMER_RST_EN_S  31

/** LP_AONCLKRST_WDT_REG register
 *  need_des
 */
#define LP_AONCLKRST_WDT_REG (DR_REG_LP_AONCLKRST_BASE + 0x10)
/** LP_AONCLKRST_LP_WDT_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_WDT_RST_EN    (BIT(31))
#define LP_AONCLKRST_LP_WDT_RST_EN_M  (LP_AONCLKRST_LP_WDT_RST_EN_V << LP_AONCLKRST_LP_WDT_RST_EN_S)
#define LP_AONCLKRST_LP_WDT_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_WDT_RST_EN_S  31

