espressif/esp-idf/components/soc/esp32s31/register/soc/lp_clkrst_reg.h
/** LP_AONCLKRST_CLOCKCALI_REG register
 *  need_des
 */
#define LP_AONCLKRST_CLOCKCALI_REG (DR_REG_LP_AONCLKRST_BASE + 0x14)
/** LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON    (BIT(29))
#define LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON_M  (LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON_V << LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON_S)
#define LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON_V  0x00000001U
#define LP_AONCLKRST_LP_CLK_CALI_XTAL_FORCE_ON_S  29
/** LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN    (BIT(30))
#define LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN_M  (LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN_V << LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN_S)
#define LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_CLK_CALI_FOSC_RST_EN_S  30
/** LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN    (BIT(31))
#define LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN_M  (LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN_V << LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN_S)
#define LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_CLK_CALI_SOSC_RST_EN_S  31

/** LP_AONCLKRST_ANAPERI_REG register
 *  need_des
 */
#define LP_AONCLKRST_ANAPERI_REG (DR_REG_LP_AONCLKRST_BASE + 0x18)
/** LP_AONCLKRST_LP_ANAPERI_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_ANAPERI_RST_EN    (BIT(31))
#define LP_AONCLKRST_LP_ANAPERI_RST_EN_M  (LP_AONCLKRST_LP_ANAPERI_RST_EN_V << LP_AONCLKRST_LP_ANAPERI_RST_EN_S)
#define LP_AONCLKRST_LP_ANAPERI_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_ANAPERI_RST_EN_S  31

/** LP_AONCLKRST_HUK_REG register
 *  need_des
 */
#define LP_AONCLKRST_HUK_REG (DR_REG_LP_AONCLKRST_BASE + 0x1c)
/** LP_AONCLKRST_LP_HUK_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_HUK_RST_EN    (BIT(31))
#define LP_AONCLKRST_LP_HUK_RST_EN_M  (LP_AONCLKRST_LP_HUK_RST_EN_V << LP_AONCLKRST_LP_HUK_RST_EN_S)
#define LP_AONCLKRST_LP_HUK_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_HUK_RST_EN_S  31

/** LP_AONCLKRST_FOSC_DFREQ_REG register
 *  need_des
 */
#define LP_AONCLKRST_FOSC_DFREQ_REG (DR_REG_LP_AONCLKRST_BASE + 0x20)
/** LP_AONCLKRST_FOSC_DFREQ : R/W; bitpos: [31:22]; default: 261;
 *  need_des
 */
#define LP_AONCLKRST_FOSC_DFREQ    0x000003FFU
#define LP_AONCLKRST_FOSC_DFREQ_M  (LP_AONCLKRST_FOSC_DFREQ_V << LP_AONCLKRST_FOSC_DFREQ_S)
#define LP_AONCLKRST_FOSC_DFREQ_V  0x000003FFU
#define LP_AONCLKRST_FOSC_DFREQ_S  22

/** LP_AONCLKRST_RC32K_DFREQ_REG register
 *  need_des
 */
#define LP_AONCLKRST_RC32K_DFREQ_REG (DR_REG_LP_AONCLKRST_BASE + 0x24)
/** LP_AONCLKRST_RC32K_DFREQ : R/W; bitpos: [31:0]; default: 650;
 *  need_des
 */
#define LP_AONCLKRST_RC32K_DFREQ    0xFFFFFFFFU
#define LP_AONCLKRST_RC32K_DFREQ_M  (LP_AONCLKRST_RC32K_DFREQ_V << LP_AONCLKRST_RC32K_DFREQ_S)
#define LP_AONCLKRST_RC32K_DFREQ_V  0xFFFFFFFFU
#define LP_AONCLKRST_RC32K_DFREQ_S  0

/** LP_AONCLKRST_SOSC_DFREQ_REG register
 *  need_des
 */
#define LP_AONCLKRST_SOSC_DFREQ_REG (DR_REG_LP_AONCLKRST_BASE + 0x28)
/** LP_AONCLKRST_SOSC_DFREQ : R/W; bitpos: [31:22]; default: 172;
 *  need_des
 */
#define LP_AONCLKRST_SOSC_DFREQ    0x000003FFU
#define LP_AONCLKRST_SOSC_DFREQ_M  (LP_AONCLKRST_SOSC_DFREQ_V << LP_AONCLKRST_SOSC_DFREQ_S)
#define LP_AONCLKRST_SOSC_DFREQ_V  0x000003FFU
#define LP_AONCLKRST_SOSC_DFREQ_S  22

/** LP_AONCLKRST_XTAL32K_REG register
 *  need_des
 */
#define LP_AONCLKRST_XTAL32K_REG (DR_REG_LP_AONCLKRST_BASE + 0x2c)
/** LP_AONCLKRST_DRES_XTAL32K : R/W; bitpos: [24:22]; default: 3;
 *  need_des
 */
#define LP_AONCLKRST_DRES_XTAL32K    0x00000007U
#define LP_AONCLKRST_DRES_XTAL32K_M  (LP_AONCLKRST_DRES_XTAL32K_V << LP_AONCLKRST_DRES_XTAL32K_S)
#define LP_AONCLKRST_DRES_XTAL32K_V  0x00000007U
#define LP_AONCLKRST_DRES_XTAL32K_S  22
/** LP_AONCLKRST_DGM_XTAL32K : R/W; bitpos: [27:25]; default: 3;
 *  need_des
 */
#define LP_AONCLKRST_DGM_XTAL32K    0x00000007U
#define LP_AONCLKRST_DGM_XTAL32K_M  (LP_AONCLKRST_DGM_XTAL32K_V << LP_AONCLKRST_DGM_XTAL32K_S)
#define LP_AONCLKRST_DGM_XTAL32K_V  0x00000007U
#define LP_AONCLKRST_DGM_XTAL32K_S  25
/** LP_AONCLKRST_DBUF_XTAL32K : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_DBUF_XTAL32K    (BIT(28))
#define LP_AONCLKRST_DBUF_XTAL32K_M  (LP_AONCLKRST_DBUF_XTAL32K_V << LP_AONCLKRST_DBUF_XTAL32K_S)
#define LP_AONCLKRST_DBUF_XTAL32K_V  0x00000001U
#define LP_AONCLKRST_DBUF_XTAL32K_S  28
/** LP_AONCLKRST_DAC_XTAL32K : R/W; bitpos: [31:29]; default: 3;
 *  need_des
 */
#define LP_AONCLKRST_DAC_XTAL32K    0x00000007U
#define LP_AONCLKRST_DAC_XTAL32K_M  (LP_AONCLKRST_DAC_XTAL32K_V << LP_AONCLKRST_DAC_XTAL32K_S)
#define LP_AONCLKRST_DAC_XTAL32K_V  0x00000007U
#define LP_AONCLKRST_DAC_XTAL32K_S  29

/** LP_AONCLKRST_HPCORE0_RESET_CAUSE_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_REG (DR_REG_LP_AONCLKRST_BASE + 0x30)
/** LP_AONCLKRST_HPCORE0_RESET_FLAG : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_FLAG    (BIT(0))
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_M  (LP_AONCLKRST_HPCORE0_RESET_FLAG_V << LP_AONCLKRST_HPCORE0_RESET_FLAG_S)
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_S  0
/** LP_AONCLKRST_HPCORE0_RESET_CAUSE : RO; bitpos: [6:1]; default: 0;
 *  6'h1: POR reset
 *  6'h3: digital system software reset
 *  6'h5: PMU HP system power down reset
 *  6'h7: HP system reset from HP watchdog0
 *  6'h8: HP system reset from HP watchdog1
 *  6'h9: HP system reset from LP watchdog
 *  6'hb: HP core reset from HP watchdog
 *  6'hc: HP core software reset
 *  6'hd: HP core reset from LP watchdog
 *  6'hf: brown out reset
 *  6'h10: LP watchdog chip reset
 *  6'h12: super watch dog reset
 *  6'h13: glitch reset
 *  6'h14: efuse crc error reset
 *  6'h16: HP usb jtag chip reset
 *  6'h17: HP usb uart chip reset
 *  6'h18: HP jtag reset
 *  6'h1a: HP core lockup
 */
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE    0x0000003FU
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_M  (LP_AONCLKRST_HPCORE0_RESET_CAUSE_V << LP_AONCLKRST_HPCORE0_RESET_CAUSE_S)
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_V  0x0000003FU
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_S  1
/** LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR    (BIT(30))
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_M  (LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_V << LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_S)
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR_S  30
/** LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR    (BIT(31))
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_M  (LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_V << LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_S)
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR_S  31

