espressif/esp-idf/components/soc/esp32s31/register/soc/lp_clkrst_reg.h
/** LP_AONCLKRST_HPCORE1_RESET_CAUSE_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_REG (DR_REG_LP_AONCLKRST_BASE + 0x34)
/** LP_AONCLKRST_HPCORE1_RESET_FLAG : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_FLAG    (BIT(0))
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_M  (LP_AONCLKRST_HPCORE1_RESET_FLAG_V << LP_AONCLKRST_HPCORE1_RESET_FLAG_S)
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_S  0
/** LP_AONCLKRST_HPCORE1_RESET_CAUSE : RO; bitpos: [6:1]; default: 0;
 *  6'h1: POR reset
 *  6'h3: digital system software reset
 *  6'h5: PMU HP system power down reset
 *  6'h7: HP system reset from HP watchdog0
 *  6'h8: HP system reset from HP watchdog1
 *  6'h9: HP system reset from LP watchdog
 *  6'hb: HP core reset from HP watchdog
 *  6'hc: HP core software reset
 *  6'hd: HP core reset from LP watchdog
 *  6'hf: brown out reset
 *  6'h10: LP watchdog chip reset
 *  6'h12: super watch dog reset
 *  6'h13: glitch reset
 *  6'h14: efuse crc error reset
 *  6'h16: HP usb jtag chip reset
 *  6'h17: HP usb uart chip reset
 *  6'h18: HP jtag reset
 *  6'h1a: HP core lockup
 */
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE    0x0000003FU
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_M  (LP_AONCLKRST_HPCORE1_RESET_CAUSE_V << LP_AONCLKRST_HPCORE1_RESET_CAUSE_S)
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_V  0x0000003FU
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_S  1
/** LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR    (BIT(30))
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_M  (LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_V << LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_S)
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR_S  30
/** LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR    (BIT(31))
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_M  (LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_V << LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_S)
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR_S  31

/** LP_AONCLKRST_LPCORE_RESET_CAUSE_REG register
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_REG (DR_REG_LP_AONCLKRST_BASE + 0x38)
/** LP_AONCLKRST_LPCORE_RESET_FLAG : RO; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_FLAG    (BIT(0))
#define LP_AONCLKRST_LPCORE_RESET_FLAG_M  (LP_AONCLKRST_LPCORE_RESET_FLAG_V << LP_AONCLKRST_LPCORE_RESET_FLAG_S)
#define LP_AONCLKRST_LPCORE_RESET_FLAG_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_FLAG_S  0
/** LP_AONCLKRST_LPCORE_RESET_CAUSE : RO; bitpos: [6:1]; default: 0;
 *  6'h1: POR reset
 *  6'h9: PMU LP PERI power down reset
 *  6'ha: PMU LP CPU reset
 *  6'hf: brown out reset
 *  6'h10: LP watchdog chip reset
 *  6'h12: super watch dog reset
 *  6'h13: glitch reset
 *  6'h14: software reset
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE    0x0000003FU
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_M  (LP_AONCLKRST_LPCORE_RESET_CAUSE_V << LP_AONCLKRST_LPCORE_RESET_CAUSE_S)
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_V  0x0000003FU
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_S  1
/** LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK : R/W; bitpos: [29]; default: 1;
 *  1'b0: enable lpcore pmu_lp_cpu_reset reset_cause, 1'b1: disable lpcore
 *  pmu_lp_cpu_reset reset_cause
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK    (BIT(29))
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_M  (LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_V << LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_S)
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK_S  29
/** LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR : WT; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR    (BIT(30))
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_M  (LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_V << LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_S)
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR_S  30
/** LP_AONCLKRST_LPCORE_RESET_FLAG_CLR : WT; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR    (BIT(31))
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_M  (LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_V << LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_S)
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_V  0x00000001U
#define LP_AONCLKRST_LPCORE_RESET_FLAG_CLR_S  31

/** LP_AONCLKRST_HPCORE0_RESET_CTRL_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_CTRL_REG (DR_REG_LP_AONCLKRST_BASE + 0x3c)
/** LP_AONCLKRST_HPCORE0_SW_STALL_CODE : R/W; bitpos: [7:0]; default: 0;
 *  reserved
 */
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE    0x000000FFU
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE_M  (LP_AONCLKRST_HPCORE0_SW_STALL_CODE_V << LP_AONCLKRST_HPCORE0_SW_STALL_CODE_S)
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE_V  0x000000FFU
#define LP_AONCLKRST_HPCORE0_SW_STALL_CODE_S  0
/** LP_AONCLKRST_HPCORE0_STALL_WAIT : R/W; bitpos: [14:8]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_STALL_WAIT    0x0000007FU
#define LP_AONCLKRST_HPCORE0_STALL_WAIT_M  (LP_AONCLKRST_HPCORE0_STALL_WAIT_V << LP_AONCLKRST_HPCORE0_STALL_WAIT_S)
#define LP_AONCLKRST_HPCORE0_STALL_WAIT_V  0x0000007FU
#define LP_AONCLKRST_HPCORE0_STALL_WAIT_S  8
/** LP_AONCLKRST_HPCORE0_STALL_EN : R/W; bitpos: [15]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_STALL_EN    (BIT(15))
#define LP_AONCLKRST_HPCORE0_STALL_EN_M  (LP_AONCLKRST_HPCORE0_STALL_EN_V << LP_AONCLKRST_HPCORE0_STALL_EN_S)
#define LP_AONCLKRST_HPCORE0_STALL_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_STALL_EN_S  15
/** LP_AONCLKRST_HPCORE0_RESET_LENGTH : R/W; bitpos: [18:16]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_RESET_LENGTH    0x00000007U
#define LP_AONCLKRST_HPCORE0_RESET_LENGTH_M  (LP_AONCLKRST_HPCORE0_RESET_LENGTH_V << LP_AONCLKRST_HPCORE0_RESET_LENGTH_S)
#define LP_AONCLKRST_HPCORE0_RESET_LENGTH_V  0x00000007U
#define LP_AONCLKRST_HPCORE0_RESET_LENGTH_S  16
/** LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET : R/W; bitpos: [19]; default: 0;
 *  write 1 to enable lp_wdt reset hpcore0 feature, write 0 to disable lp_wdt reset
 *  hpcore0 feature
 */
#define LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET    (BIT(19))
#define LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET_M  (LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET_V << LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET_S)
#define LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_ENABLE_LP_WDT_RESET_S  19
/** LP_AONCLKRST_HPCORE0_SW_RESET : WT; bitpos: [20]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_SW_RESET    (BIT(20))
#define LP_AONCLKRST_HPCORE0_SW_RESET_M  (LP_AONCLKRST_HPCORE0_SW_RESET_V << LP_AONCLKRST_HPCORE0_SW_RESET_S)
#define LP_AONCLKRST_HPCORE0_SW_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_SW_RESET_S  20
/** LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET    (BIT(29))
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_M  (LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_V << LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_S)
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET_S  29
/** LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL : R/W; bitpos: [30]; default: 1;
 *  1'b1: boot from HP TCM ROM: 0x4FC00000
 *  1'b0: boot from LP TCM RAM:  0x50108000
 */
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL    (BIT(30))
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_M  (LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_V << LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_S)
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL_S  30
/** LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN : R/W; bitpos: [31]; default: 0;
 *  write 1 to enable hpcore0 lockup reset feature, write 0 to disable hpcore0 lockup
 *  reset feature
 */
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN    (BIT(31))
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_M  (LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_V << LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_S)
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN_S  31

/** LP_AONCLKRST_HPCORE1_RESET_CTRL_REG register
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_CTRL_REG (DR_REG_LP_AONCLKRST_BASE + 0x40)
/** LP_AONCLKRST_HPCORE1_SW_STALL_CODE : R/W; bitpos: [7:0]; default: 0;
 *  reserved
 */
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE    0x000000FFU
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE_M  (LP_AONCLKRST_HPCORE1_SW_STALL_CODE_V << LP_AONCLKRST_HPCORE1_SW_STALL_CODE_S)
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE_V  0x000000FFU
#define LP_AONCLKRST_HPCORE1_SW_STALL_CODE_S  0
/** LP_AONCLKRST_HPCORE1_STALL_WAIT : R/W; bitpos: [14:8]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_STALL_WAIT    0x0000007FU
#define LP_AONCLKRST_HPCORE1_STALL_WAIT_M  (LP_AONCLKRST_HPCORE1_STALL_WAIT_V << LP_AONCLKRST_HPCORE1_STALL_WAIT_S)
#define LP_AONCLKRST_HPCORE1_STALL_WAIT_V  0x0000007FU
#define LP_AONCLKRST_HPCORE1_STALL_WAIT_S  8
/** LP_AONCLKRST_HPCORE1_STALL_EN : R/W; bitpos: [15]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_STALL_EN    (BIT(15))
#define LP_AONCLKRST_HPCORE1_STALL_EN_M  (LP_AONCLKRST_HPCORE1_STALL_EN_V << LP_AONCLKRST_HPCORE1_STALL_EN_S)
#define LP_AONCLKRST_HPCORE1_STALL_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_STALL_EN_S  15
/** LP_AONCLKRST_HPCORE1_RESET_LENGTH : R/W; bitpos: [18:16]; default: 1;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_RESET_LENGTH    0x00000007U
#define LP_AONCLKRST_HPCORE1_RESET_LENGTH_M  (LP_AONCLKRST_HPCORE1_RESET_LENGTH_V << LP_AONCLKRST_HPCORE1_RESET_LENGTH_S)
#define LP_AONCLKRST_HPCORE1_RESET_LENGTH_V  0x00000007U
#define LP_AONCLKRST_HPCORE1_RESET_LENGTH_S  16
/** LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET : R/W; bitpos: [19]; default: 0;
 *  write 1 to enable lp_wdt reset hpcore1 feature, write 0 to disable lp_wdt reset
 *  hpcore1 feature
 */
#define LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET    (BIT(19))
#define LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET_M  (LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET_V << LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET_S)
#define LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_ENABLE_LP_WDT_RESET_S  19
/** LP_AONCLKRST_HPCORE1_SW_RESET : WT; bitpos: [20]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_SW_RESET    (BIT(20))
#define LP_AONCLKRST_HPCORE1_SW_RESET_M  (LP_AONCLKRST_HPCORE1_SW_RESET_V << LP_AONCLKRST_HPCORE1_SW_RESET_S)
#define LP_AONCLKRST_HPCORE1_SW_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_SW_RESET_S  20
/** LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET : R/W; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET    (BIT(29))
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_M  (LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_V << LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_S)
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET_S  29
/** LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL : R/W; bitpos: [30]; default: 1;
 *  1'b1: boot from HP TCM ROM: 0x4FC00000
 *  1'b0: boot from LP TCM RAM:  0x50108000
 */
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL    (BIT(30))
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_M  (LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_V << LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_S)
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL_S  30
/** LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN : R/W; bitpos: [31]; default: 0;
 *  write 1 to enable hpcore1 lockup reset feature, write 0 to disable hpcore1 lockup
 *  reset feature
 */
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN    (BIT(31))
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_M  (LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_V << LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_S)
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_V  0x00000001U
#define LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN_S  31

/** LP_AONCLKRST_TOUCH_AON_REG register
 *  need_des
 */
#define LP_AONCLKRST_TOUCH_AON_REG (DR_REG_LP_AONCLKRST_BASE + 0x44)
/** LP_AONCLKRST_TOUCH_AON_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_TOUCH_AON_RST_EN    (BIT(31))
#define LP_AONCLKRST_TOUCH_AON_RST_EN_M  (LP_AONCLKRST_TOUCH_AON_RST_EN_V << LP_AONCLKRST_TOUCH_AON_RST_EN_S)
#define LP_AONCLKRST_TOUCH_AON_RST_EN_V  0x00000001U
#define LP_AONCLKRST_TOUCH_AON_RST_EN_S  31

/** LP_AONCLKRST_HP_CLK_CTRL_REG register
 *  HP Clock Control Register.
 */
#define LP_AONCLKRST_HP_CLK_CTRL_REG (DR_REG_LP_AONCLKRST_BASE + 0x48)
/** LP_AONCLKRST_CLK_XTAL_FREQ : RO; bitpos: [6:0]; default: 40;
 *  XTAL Clock Freq Indication. 7'd40: xtal_40m, 7'd48: xtal_48m
 */
#define LP_AONCLKRST_CLK_XTAL_FREQ    0x0000007FU
#define LP_AONCLKRST_CLK_XTAL_FREQ_M  (LP_AONCLKRST_CLK_XTAL_FREQ_V << LP_AONCLKRST_CLK_XTAL_FREQ_S)
#define LP_AONCLKRST_CLK_XTAL_FREQ_V  0x0000007FU
#define LP_AONCLKRST_CLK_XTAL_FREQ_S  0

/** LP_AONCLKRST_CPLL_DIV_REG register
 *  need_des
 */
#define LP_AONCLKRST_CPLL_DIV_REG (DR_REG_LP_AONCLKRST_BASE + 0x4c)
/** LP_AONCLKRST_CPLL_REF_DIV : R/W; bitpos: [3:0]; default: 2;
 *  cpll ref div value
 */
#define LP_AONCLKRST_CPLL_REF_DIV    0x0000000FU
#define LP_AONCLKRST_CPLL_REF_DIV_M  (LP_AONCLKRST_CPLL_REF_DIV_V << LP_AONCLKRST_CPLL_REF_DIV_S)
#define LP_AONCLKRST_CPLL_REF_DIV_V  0x0000000FU
#define LP_AONCLKRST_CPLL_REF_DIV_S  0
/** LP_AONCLKRST_CPLL_FB_DIV : R/W; bitpos: [11:4]; default: 15;
 *  cpll fb div value
 */
#define LP_AONCLKRST_CPLL_FB_DIV    0x000000FFU
#define LP_AONCLKRST_CPLL_FB_DIV_M  (LP_AONCLKRST_CPLL_FB_DIV_V << LP_AONCLKRST_CPLL_FB_DIV_S)
#define LP_AONCLKRST_CPLL_FB_DIV_V  0x000000FFU
#define LP_AONCLKRST_CPLL_FB_DIV_S  4

