espressif/esp-idf/components/soc/esp32s31/register/soc/lp_clkrst_reg.h
/** LP_AONCLKRST_APLL_DIV_REG register
 *  need_des
 */
#define LP_AONCLKRST_APLL_DIV_REG (DR_REG_LP_AONCLKRST_BASE + 0x50)
/** LP_AONCLKRST_APLL_REF_DIV : R/W; bitpos: [2:0]; default: 5;
 *  apll ref div value
 */
#define LP_AONCLKRST_APLL_REF_DIV    0x00000007U
#define LP_AONCLKRST_APLL_REF_DIV_M  (LP_AONCLKRST_APLL_REF_DIV_V << LP_AONCLKRST_APLL_REF_DIV_S)
#define LP_AONCLKRST_APLL_REF_DIV_V  0x00000007U
#define LP_AONCLKRST_APLL_REF_DIV_S  0
/** LP_AONCLKRST_APLL_OUT_DIV : R/W; bitpos: [7:3]; default: 16;
 *  apll out div value
 */
#define LP_AONCLKRST_APLL_OUT_DIV    0x0000001FU
#define LP_AONCLKRST_APLL_OUT_DIV_M  (LP_AONCLKRST_APLL_OUT_DIV_V << LP_AONCLKRST_APLL_OUT_DIV_S)
#define LP_AONCLKRST_APLL_OUT_DIV_V  0x0000001FU
#define LP_AONCLKRST_APLL_OUT_DIV_S  3

/** LP_AONCLKRST_MSPI_DIV_REG register
 *  need_des
 */
#define LP_AONCLKRST_MSPI_DIV_REG (DR_REG_LP_AONCLKRST_BASE + 0x54)
/** LP_AONCLKRST_MSPI_REF_DIV : R/W; bitpos: [2:0]; default: 1;
 *  MSPI ref div value
 */
#define LP_AONCLKRST_MSPI_REF_DIV    0x00000007U
#define LP_AONCLKRST_MSPI_REF_DIV_M  (LP_AONCLKRST_MSPI_REF_DIV_V << LP_AONCLKRST_MSPI_REF_DIV_S)
#define LP_AONCLKRST_MSPI_REF_DIV_V  0x00000007U
#define LP_AONCLKRST_MSPI_REF_DIV_S  0
/** LP_AONCLKRST_MSPI_FB_DIV : R/W; bitpos: [7:3]; default: 24;
 *  MSPI fb div value
 */
#define LP_AONCLKRST_MSPI_FB_DIV    0x0000001FU
#define LP_AONCLKRST_MSPI_FB_DIV_M  (LP_AONCLKRST_MSPI_FB_DIV_V << LP_AONCLKRST_MSPI_FB_DIV_S)
#define LP_AONCLKRST_MSPI_FB_DIV_V  0x0000001FU
#define LP_AONCLKRST_MSPI_FB_DIV_S  3
/** LP_AONCLKRST_MSPI_CHGP_DCUR : R/W; bitpos: [8]; default: 0;
 *  MSPI chgp_dcur value
 */
#define LP_AONCLKRST_MSPI_CHGP_DCUR    (BIT(8))
#define LP_AONCLKRST_MSPI_CHGP_DCUR_M  (LP_AONCLKRST_MSPI_CHGP_DCUR_V << LP_AONCLKRST_MSPI_CHGP_DCUR_S)
#define LP_AONCLKRST_MSPI_CHGP_DCUR_V  0x00000001U
#define LP_AONCLKRST_MSPI_CHGP_DCUR_S  8
/** LP_AONCLKRST_MSPI_LF_RES : R/W; bitpos: [9]; default: 0;
 *  MSPI lf_res value
 */
#define LP_AONCLKRST_MSPI_LF_RES    (BIT(9))
#define LP_AONCLKRST_MSPI_LF_RES_M  (LP_AONCLKRST_MSPI_LF_RES_V << LP_AONCLKRST_MSPI_LF_RES_S)
#define LP_AONCLKRST_MSPI_LF_RES_V  0x00000001U
#define LP_AONCLKRST_MSPI_LF_RES_S  9

/** LP_AONCLKRST_LP_ADI_REG register
 *  need_des
 */
#define LP_AONCLKRST_LP_ADI_REG (DR_REG_LP_AONCLKRST_BASE + 0x58)
/** LP_AONCLKRST_LP_ADI_RST_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_LP_ADI_RST_EN    (BIT(31))
#define LP_AONCLKRST_LP_ADI_RST_EN_M  (LP_AONCLKRST_LP_ADI_RST_EN_V << LP_AONCLKRST_LP_ADI_RST_EN_S)
#define LP_AONCLKRST_LP_ADI_RST_EN_V  0x00000001U
#define LP_AONCLKRST_LP_ADI_RST_EN_S  31

/** LP_AONCLKRST_LPROOT_CLK_DIV_REG register
 *  need_des
 */
#define LP_AONCLKRST_LPROOT_CLK_DIV_REG (DR_REG_LP_AONCLKRST_BASE + 0x5c)
/** LP_AONCLKRST_LPAON_CLK_DIV_NUM : R/W; bitpos: [2:0]; default: 0;
 *  lp aon clock divide num
 */
#define LP_AONCLKRST_LPAON_CLK_DIV_NUM    0x00000007U
#define LP_AONCLKRST_LPAON_CLK_DIV_NUM_M  (LP_AONCLKRST_LPAON_CLK_DIV_NUM_V << LP_AONCLKRST_LPAON_CLK_DIV_NUM_S)
#define LP_AONCLKRST_LPAON_CLK_DIV_NUM_V  0x00000007U
#define LP_AONCLKRST_LPAON_CLK_DIV_NUM_S  0
/** LP_AONCLKRST_LPPERI_CLK_DIV_NUM : R/W; bitpos: [6:4]; default: 0;
 *  lp peri clock divide num
 */
#define LP_AONCLKRST_LPPERI_CLK_DIV_NUM    0x00000007U
#define LP_AONCLKRST_LPPERI_CLK_DIV_NUM_M  (LP_AONCLKRST_LPPERI_CLK_DIV_NUM_V << LP_AONCLKRST_LPPERI_CLK_DIV_NUM_S)
#define LP_AONCLKRST_LPPERI_CLK_DIV_NUM_V  0x00000007U
#define LP_AONCLKRST_LPPERI_CLK_DIV_NUM_S  4

/** LP_AONCLKRST_CPLL_CFG_REG register
 *  need_des
 */
#define LP_AONCLKRST_CPLL_CFG_REG (DR_REG_LP_AONCLKRST_BASE + 0x60)
/** LP_AONCLKRST_CPLL_DBIAS : R/W; bitpos: [2:0]; default: 0;
 *  cpll dbias value
 */
#define LP_AONCLKRST_CPLL_DBIAS    0x00000007U
#define LP_AONCLKRST_CPLL_DBIAS_M  (LP_AONCLKRST_CPLL_DBIAS_V << LP_AONCLKRST_CPLL_DBIAS_S)
#define LP_AONCLKRST_CPLL_DBIAS_V  0x00000007U
#define LP_AONCLKRST_CPLL_DBIAS_S  0
/** LP_AONCLKRST_CPLL_DCHGP : R/W; bitpos: [5:3]; default: 0;
 *  cpll dchgp value
 */
#define LP_AONCLKRST_CPLL_DCHGP    0x00000007U
#define LP_AONCLKRST_CPLL_DCHGP_M  (LP_AONCLKRST_CPLL_DCHGP_V << LP_AONCLKRST_CPLL_DCHGP_S)
#define LP_AONCLKRST_CPLL_DCHGP_V  0x00000007U
#define LP_AONCLKRST_CPLL_DCHGP_S  3
/** LP_AONCLKRST_CPLL_DR1 : R/W; bitpos: [8:6]; default: 0;
 *  cpll dr1 value
 */
#define LP_AONCLKRST_CPLL_DR1    0x00000007U
#define LP_AONCLKRST_CPLL_DR1_M  (LP_AONCLKRST_CPLL_DR1_V << LP_AONCLKRST_CPLL_DR1_S)
#define LP_AONCLKRST_CPLL_DR1_V  0x00000007U
#define LP_AONCLKRST_CPLL_DR1_S  6
/** LP_AONCLKRST_CPLL_DR3 : R/W; bitpos: [11:9]; default: 0;
 *  cpll dr3 value
 */
#define LP_AONCLKRST_CPLL_DR3    0x00000007U
#define LP_AONCLKRST_CPLL_DR3_M  (LP_AONCLKRST_CPLL_DR3_V << LP_AONCLKRST_CPLL_DR3_S)
#define LP_AONCLKRST_CPLL_DR3_V  0x00000007U
#define LP_AONCLKRST_CPLL_DR3_S  9

/** LP_AONCLKRST_APLL_SDM_REG register
 *  need_des
 */
#define LP_AONCLKRST_APLL_SDM_REG (DR_REG_LP_AONCLKRST_BASE + 0x64)
/** LP_AONCLKRST_APLL_SDM : R/W; bitpos: [21:0]; default: 0;
 *  apll sdm value
 */
#define LP_AONCLKRST_APLL_SDM    0x003FFFFFU
#define LP_AONCLKRST_APLL_SDM_M  (LP_AONCLKRST_APLL_SDM_V << LP_AONCLKRST_APLL_SDM_S)
#define LP_AONCLKRST_APLL_SDM_V  0x003FFFFFU
#define LP_AONCLKRST_APLL_SDM_S  0

/** LP_AONCLKRST_RTC_SAR2_PWDET_CCT_REG register
 *  need_des
 */
#define LP_AONCLKRST_RTC_SAR2_PWDET_CCT_REG (DR_REG_LP_AONCLKRST_BASE + 0x68)
/** LP_AONCLKRST_RTC_SAR2_PWDET_CCT : R/W; bitpos: [2:0]; default: 0;
 *  rtc_sar2_pwdet_cct value
 */
#define LP_AONCLKRST_RTC_SAR2_PWDET_CCT    0x00000007U
#define LP_AONCLKRST_RTC_SAR2_PWDET_CCT_M  (LP_AONCLKRST_RTC_SAR2_PWDET_CCT_V << LP_AONCLKRST_RTC_SAR2_PWDET_CCT_S)
#define LP_AONCLKRST_RTC_SAR2_PWDET_CCT_V  0x00000007U
#define LP_AONCLKRST_RTC_SAR2_PWDET_CCT_S  0

/** LP_AONCLKRST_DATE_REG register
 *  need_des
 */
#define LP_AONCLKRST_DATE_REG (DR_REG_LP_AONCLKRST_BASE + 0x3fc)
/** LP_AONCLKRST_DATE : R/W; bitpos: [30:0]; default: 38826752;
 *  need_des
 */
#define LP_AONCLKRST_DATE    0x7FFFFFFFU
#define LP_AONCLKRST_DATE_M  (LP_AONCLKRST_DATE_V << LP_AONCLKRST_DATE_S)
#define LP_AONCLKRST_DATE_V  0x7FFFFFFFU
#define LP_AONCLKRST_DATE_S  0
/** LP_AONCLKRST_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_AONCLKRST_CLK_EN    (BIT(31))
#define LP_AONCLKRST_CLK_EN_M  (LP_AONCLKRST_CLK_EN_V << LP_AONCLKRST_CLK_EN_S)
#define LP_AONCLKRST_CLK_EN_V  0x00000001U
#define LP_AONCLKRST_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
